{
  "project": "Bullseye",
  "branchName": "ralph/user-customization",
  "description": "User customization (avatar, display name), agent personalization, and studio deletion with cascade warnings",
  "userStories": [
    {
      "id": "US-001",
      "title": "Reusable UserAvatar component",
      "description": "As a developer, I need a reusable avatar component that shows an uploaded image or falls back to styled initials.",
      "acceptanceCriteria": [
        "Shared component at src/components/shared/user-avatar.tsx",
        "Props: src (string | null | undefined), name (string | null | undefined), email (string | undefined), size ('sm' | 'md' | 'lg') where sm=28px, md=40px, lg=64px",
        "If src provided: renders circular img with object-cover and rounded-full",
        "If no src: renders initials (first letter of name, or first letter of email, or '?') in a colored circle",
        "Initials background color derived deterministically from name/email string (hash to a small palette of muted colors)",
        "Text color is white for all background colors",
        "Component exported as named export",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "User profile API routes",
      "description": "As a developer, I need API routes for reading and updating the user's display name and avatar URL.",
      "acceptanceCriteria": [
        "GET /api/user/profile returns { displayName: string | null, email: string, avatarUrl: string | null }",
        "PUT /api/user/profile accepts { displayName?: string, avatarUrl?: string } and updates the User record in Prisma",
        "displayName validated: trimmed, 1-50 characters if provided, returns 400 if empty string or over 50 chars",
        "Both routes validate auth via getCurrentUser() — return 401 if unauthenticated",
        "PUT returns the updated user profile object",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": "User model already has name and avatarUrl fields in Prisma schema"
    },
    {
      "id": "US-003",
      "title": "Avatar upload API route",
      "description": "As a developer, I need an API route to upload avatar images to Supabase Storage.",
      "acceptanceCriteria": [
        "POST /api/user/avatar accepts multipart form data with an image file field",
        "Validates file type: only jpg, jpeg, png, webp, gif accepted — returns 400 for others",
        "File size limit: 2MB — returns 400 if exceeded",
        "Stores image in Supabase Storage bucket 'avatars' at path '{userId}.{ext}' (overwrites previous avatar)",
        "Uses Supabase admin client (service role) for storage upload",
        "Updates User record's avatarUrl field with the public URL from Supabase Storage",
        "Returns { avatarUrl: string } with the new public URL",
        "Route validates auth — returns 401 if unauthenticated",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": "Use createAdminClient() from src/lib/supabase/admin.ts for storage operations"
    },
    {
      "id": "US-004",
      "title": "Settings — user profile section UI",
      "description": "As a user, I want to edit my display name and avatar in Settings so I can personalize my experience.",
      "acceptanceCriteria": [
        "Settings view shows a 'Profile' section above the existing 'Claude API Key' section",
        "Profile section displays: circular avatar preview (64px using UserAvatar component with size='lg'), display name input, email as read-only muted text",
        "Avatar area: clicking opens file picker (accept='image/jpeg,image/png,image/webp,image/gif')",
        "After file selected: uploads to POST /api/user/avatar, shows Loader2 spinner during upload, updates preview on success",
        "If no avatar uploaded: UserAvatar shows initials with subtle 'Upload' text overlay on hover (opacity transition)",
        "Display name input: pre-filled from GET /api/user/profile, saves on blur or Enter via PUT /api/user/profile",
        "Success toast shown on display name save and avatar upload",
        "Email shown as read-only label below display name with text: 'Username (cannot be changed)'",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Nav avatar replaces gear icon for Settings access",
      "description": "As a user, I want my avatar in the bottom-left nav to be the way to access Settings.",
      "acceptanceCriteria": [
        "Remove the existing Settings tab entry (gear icon) from the nav rail tab list",
        "The user avatar circle in the bottom-left nav now calls setActiveTab('settings') on click",
        "Avatar renders using UserAvatar component with size='sm', passing avatarUrl and displayName from user state",
        "User profile data fetched via GET /api/user/profile on app mount (React Query hook useUserProfile with long staleTime)",
        "Tooltip on avatar shows display name if set, otherwise email",
        "Active state: ring-2 ring-bullseye-gold around avatar when Settings tab is active",
        "Mobile bottom tab bar: replace Settings gear icon with UserAvatar size='sm'",
        "Remove the old sign-out button from nav — move sign-out to Settings page instead",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": false,
      "notes": "Keep Settings as a valid tab in the activeTab type. Just change the nav entry point from gear icon to avatar."
    },
    {
      "id": "US-006",
      "title": "Inject user display name into agent prompts",
      "description": "As a user, I want Scout and readers to know my name so interactions feel personalized.",
      "acceptanceCriteria": [
        "Scout API route retrieves user's name field from the User record (already have user from getCurrentUser())",
        "If user.name is set, append to Scout system prompt: 'The user you are working with is named {name}. Address them by name occasionally in conversation — naturally, not forced.'",
        "If no display name set, do not inject any user name context (agents behave as before)",
        "Reader chat API route also appends user name context to the reader's system prompt",
        "Focus group engine receives userName parameter and includes it in moderator context",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": false,
      "notes": "Keep it subtle — append a short line to existing prompts, don't restructure them"
    },
    {
      "id": "US-007",
      "title": "Remove Studio tab from project-level navigation",
      "description": "As a developer, I need to remove the Studio tab from the project-level tab bar since studio config is now accessed via the overlay.",
      "acceptanceCriteria": [
        "Remove 'studio' entry from the project tabs array in app-shell.tsx",
        "Remove StudioView import and rendering from the tab content switch in page.tsx",
        "Studio tab no longer appears in desktop nav rail or mobile bottom tab bar",
        "The studio-view.tsx component file is NOT deleted (it will be reused)",
        "activeTab type updated if needed to remove 'studio' as a valid project tab value",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Studio switcher overlay opens Studio Config view",
      "description": "As a user, I want clicking a studio in the overlay to open its configuration page.",
      "acceptanceCriteria": [
        "Add a new view mode 'studioConfig' to the app (either as a special activeTab value or a separate Zustand flag like isStudioConfigOpen: boolean)",
        "Clicking a studio name in StudioSwitcherDropdown sets that studio as active AND switches to Studio Config view",
        "Studio Config view renders the existing StudioView component (Readers, Executives, Calibration, Settings sub-tabs)",
        "A back/close button (ArrowLeft or X icon) in the Studio Config header returns to the previous tab",
        "The studio switcher button tooltip in the nav shows 'Studios'",
        "Nav rail shows a building/warehouse icon with 'Studio Config' tooltip when this view is active",
        "Studio names in the overlay update reactively when the name is edited in Studio Config → Settings (React Query invalidation)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": false,
      "notes": "useStudio() hook data should invalidate when studio name is saved in settings sub-tab"
    },
    {
      "id": "US-009",
      "title": "Studio deletion — backend API",
      "description": "As a developer, I need an API route to delete a studio with full cascade deletion.",
      "acceptanceCriteria": [
        "DELETE /api/studio/[id] route created",
        "Validates auth and that user is the studio owner (check studio.ownerId === user.id)",
        "Returns 400 if this is the user's only studio: { error: 'Cannot delete your only studio' }",
        "Deletes all associated files from Supabase Storage: list and remove all files under scripts/{projectId}/ for each project in the studio",
        "Deletes the studio record (Prisma cascade should handle: projects → drafts → deliverables, focus sessions, reader memories, executive evaluations, chat messages, plus reader personas, executive profiles, studio intelligence)",
        "Returns { deletedProjects: number } with the count of projects that were in the studio",
        "Typecheck passes"
      ],
      "priority": 9,
      "passes": false,
      "notes": "Check that Prisma schema has onDelete: Cascade on the Project → Studio relation. If not, delete projects manually first."
    },
    {
      "id": "US-010",
      "title": "Studio deletion — UI with cascade warning",
      "description": "As a user, I want to delete a studio from its Settings page with a clear warning about permanent data loss.",
      "acceptanceCriteria": [
        "Studio Config → Settings sub-tab shows a 'Danger Zone' section at the bottom with red/destructive border",
        "'Delete Studio' button (destructive variant — red) in the danger zone",
        "Clicking opens a confirmation dialog/overlay showing: studio name prominently, warning text 'This will permanently delete this studio and all N projects within it. This cannot be undone.'",
        "Project count displayed in the warning (derived from useProjects or passed from studio data)",
        "If studio has projects: text input requiring user to type the studio name to confirm, 'Delete Studio' button enabled only when typed text matches studio name exactly",
        "If studio has zero projects: simpler confirmation with just a 'Delete Studio' button (no name-typing required)",
        "On confirm: calls DELETE /api/studio/[id], shows success toast 'Studio deleted', switches to another available studio and navigates to Home",
        "React Query cache invalidated for studio list",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 10,
      "passes": false,
      "notes": ""
    }
  ]
}
