{
  "project": "Bullseye",
  "branchName": "ralph/settings-studio-cleanup",
  "description": "Fix API key saving, clear stale studios, dedicated user settings page, and Studio Info tab with POV/Pillars/Beliefs/Mandates",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add POV, Pillars, Beliefs, Mandates fields to Studio model",
      "description": "As a developer, I need to store studio identity fields (POV, Pillars, Beliefs, Mandates) in the database so they persist across sessions.",
      "acceptanceCriteria": [
        "Add fields to Studio model in prisma/schema.prisma: pov String? (nullable text), pillars String[] (default []), beliefs String[] (default []), mandates String[] (default [])",
        "Generate Prisma migration successfully (npx prisma migrate dev --name add_studio_identity_fields)",
        "Prisma client regenerates with new fields available on Studio type",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Schema-only change. API updates in next story."
    },
    {
      "id": "US-002",
      "title": "Update Studio API to support identity fields",
      "description": "As a developer, I need the PUT /api/studio endpoint to accept and persist pov, pillars, beliefs, and mandates fields.",
      "acceptanceCriteria": [
        "PUT /api/studio accepts optional fields: pov (string | null), pillars (string[]), beliefs (string[]), mandates (string[])",
        "GET /api/studio returns the new fields in the response (pov, pillars, beliefs, mandates)",
        "Partial updates work — sending only { pov: 'new value' } updates pov without clearing pillars/beliefs/mandates",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Uses existing conditional spread pattern for partial updates: ...(body.field !== undefined && { field: body.field })"
    },
    {
      "id": "US-003",
      "title": "Fix API key save failure",
      "description": "As a user, I want to save my Anthropic API key without getting 'Failed to save API key' error.",
      "acceptanceCriteria": [
        "Identify and fix root cause of save failure in /api/settings/route.ts (check DB connection, encryption, auth, UserSettings upsert)",
        "API key with valid sk-ant- prefix saves successfully to UserSettings table",
        "Success feedback shown after save (e.g., toast or inline 'API key saved successfully' message)",
        "Error messages are specific (show actual error reason, not generic 'Failed to save API key')",
        "Key persists across page refreshes (verify by reloading settings page — key indicator shows 'saved')",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "The catch block in settings-view.tsx:74 swallows errors. The actual failure is likely in the API route — check DB upsert, encryption setup, or auth. Console.error the real error server-side."
    },
    {
      "id": "US-004",
      "title": "Migration script to clear all studios",
      "description": "As a developer, I need a one-time script to delete all existing studios across all user accounts to remove stale/undeletable studios from early accounts.",
      "acceptanceCriteria": [
        "Script at scripts/clear-all-studios.ts that connects to the database",
        "Deletes ALL Studio records with Prisma cascade (projects, drafts, deliverables, focus sessions, reader personas, executive profiles, studio intelligence all removed)",
        "Cleans up Supabase Storage files: lists and removes all files in 'scripts' bucket",
        "Resets all User records: sets studioId to null (or removes the FK reference) so users get fresh onboarding",
        "Script is idempotent (safe to run when no studios exist)",
        "Script logs progress: number of studios deleted, storage files cleaned, users reset",
        "Can be run via: npx tsx scripts/clear-all-studios.ts",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Use Prisma deleteMany for studios. Use Supabase admin client for storage cleanup. Must handle the User.studioId FK — either set to null or handle the constraint."
    },
    {
      "id": "US-005",
      "title": "Studio Config — Add Studio Info tab as first tab",
      "description": "As a user, I want to define my studio's POV, Pillars, Beliefs, and Mandates in a dedicated Studio Info tab so the AI analysis reflects my creative identity.",
      "acceptanceCriteria": [
        "New 'Studio Info' tab added as the FIRST tab in Studio Config (tab order: Studio Info, Readers, Executives, Calibration, Settings)",
        "TabsList grid updated from grid-cols-4 to grid-cols-5",
        "Studio Info tab displays: POV section with textarea (label: 'Point of View', helper text explaining purpose), Pillars section with editable list, Beliefs section with editable list, Mandates section with editable list",
        "Each list section (Pillars/Beliefs/Mandates) has: existing items displayed as removable entries, input field with '+' or 'Add' button to add new items, remove button (X icon) on each item",
        "Save button at bottom calls PUT /api/studio with updated pov, pillars, beliefs, mandates",
        "Save shows Loader2 spinner while pending, success toast on completion",
        "Data pre-filled from useStudio() hook on mount",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Use the existing useStudio() hook for data fetching. Invalidate studioKeys.studio on save. Follow existing edit patterns from ReadersSection/ExecutivesSection."
    },
    {
      "id": "US-006",
      "title": "Create dedicated User Settings page at /settings",
      "description": "As a user, I want a dedicated settings page for my account with User Settings, API Keys, and Account Settings sections.",
      "acceptanceCriteria": [
        "New page at src/app/settings/page.tsx (Next.js App Router)",
        "Page has 3 clearly separated sections with headings: 'User Settings' section — display name input (pre-filled from useUserProfile), avatar upload (click avatar to open file picker, shows UserAvatar lg), email as read-only text. 'API Keys' section — Anthropic API key input with save button, validation (sk-ant- prefix), success/error feedback (reuse logic from settings-view.tsx). 'Account Settings' section — Sign Out button (uses Supabase signOut + router push to /login)",
        "Page has a header with 'Settings' title and back button (ArrowLeft icon) that navigates to previous page (router.back())",
        "Page is styled consistently with existing app (bg-background, card sections with bg-surface, proper padding)",
        "Page is protected — redirects to /login if unauthenticated",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": "Reuse useUserProfile, useUpdateDisplayName, useUploadAvatar hooks. Reuse API key save logic from settings-view.tsx (encryption via /api/settings). This is a standalone page, not a tab in the app shell."
    },
    {
      "id": "US-007",
      "title": "Studio Config Settings tab — remove user-level content",
      "description": "As a user, I want the Studio Config Settings tab to only show studio-specific settings (name and delete), not user profile or API key.",
      "acceptanceCriteria": [
        "Settings tab in studio-view.tsx contains ONLY: SettingsSection (studio name input with save) and DangerZoneSection (delete studio with confirmation)",
        "ProfileSection component removed from Settings tab rendering",
        "SignOutSection component removed from Settings tab rendering",
        "Any API key references removed from this tab (API key is now in /settings page)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": "ProfileSection and SignOutSection code can be deleted from studio-view.tsx since they're now in the /settings page."
    },
    {
      "id": "US-008",
      "title": "Add user avatar to bottom-left of app shell, navigate to /settings",
      "description": "As a user, I want my avatar always visible in the bottom-left corner of the app shell so I can quickly access my account settings page.",
      "acceptanceCriteria": [
        "User avatar (UserAvatar component, size='sm') rendered in the bottom-left of the app shell sidebar/nav rail, below the studio switcher",
        "Avatar displays user image if set, otherwise initials with color-coded background (uses useUserProfile hook)",
        "Avatar is always visible regardless of which tab/view is active",
        "Clicking the avatar navigates to /settings page (router.push('/settings'))",
        "Tooltip on avatar shows display name if set, otherwise email, fallback 'Settings'",
        "Mobile bottom tab bar: avatar shown at the end/right of the tab bar, same click behavior",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Use Next.js router for navigation to /settings. The avatar was previously used for tab switching — now it's a router.push to a dedicated page."
    },
    {
      "id": "US-009",
      "title": "Handle empty studio state after migration",
      "description": "As a user, after the studio cleanup migration, I want the app to gracefully handle having no studios and prompt me to create one.",
      "acceptanceCriteria": [
        "App shell checks if user has any studios on mount (via useStudio or GET /api/studio)",
        "If no studios exist: app shows a create-studio prompt/modal (studio name input + Create button)",
        "Creating a studio calls POST /api/studio (create the endpoint if it doesn't exist) with the name",
        "After creation: sets new studio as currentStudio in Zustand, navigates to Home tab",
        "Zustand store handles currentStudio being null without crashing (guards throughout the app)",
        "If localStorage bullseye-storage references a deleted studio ID, the app resets gracefully (doesn't crash)",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 9,
      "passes": true,
      "notes": "The Zustand store persists currentStudio and studios in localStorage. After migration clears the DB, these will be stale. The app must detect the mismatch and reset."
    }
  ]
}
